spec/fixtures/requests/activate/unsigned_soap.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/wholesaleActivateSubscription/v4/wholesaleActivateSubscriptionV4.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:wholesaleActivateSubscriptionV4>
<sub:deviceInfoList>
<sub:deviceInfo>
<sub:serialNumber>12345678901</sub:serialNumber>
<sub:serialType>E</sub:serialType>
</sub:deviceInfo>
</sub:deviceInfoList>
<sub:csa>MIAWPB561</sub:csa>
<sub:pricePlan>
<sub:serviceCode>TESTPLAN</sub:serviceCode>
</sub:pricePlan>
<sub:serviceList>
<sub:serviceRecord>
<sub:serviceCode>TESTNVM</sub:serviceCode>
</sub:serviceRecord>
<sub:serviceRecord>
<sub:serviceCode>TESTPMVM</sub:serviceCode>
</sub:serviceRecord>
<sub:serviceRecord>
<sub:serviceCode>TESTINTCL</sub:serviceCode>
</sub:serviceRecord>
</sub:serviceList>
<sub:fetchDeviceDetailInfo>true</sub:fetchDeviceDetailInfo>
</sub:wholesaleActivateSubscriptionV4>
</soapenv:Body>
</soapenv:Envelope>
